diary/20241110-1236.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.p-snow.org/config/diary/rss.xml"
      title="RSS feed for https://www.p-snow.org/config/diary">
<title>閲覧中のウェブページを Org 形式で開く</title>
<meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1.0"><link rel="stylesheet" href="https://cdn.simplecss.org/simple.css"><link rel="stylesheet" href="./assets/css/style.css"></head>
<body>
<div id="preamble" class="status"><header><nav><a href="https://www.p-snow.org/config/diary">ホーム</a><a href="https://www.p-snow.org/config/diary/about.html">あばうと</a><a href="https://www.p-snow.org/config/diary/rss.xml">RSS</a></nav><h1>ティンカラー日記</h1><p>こなゆき(a.k.a. p-snow)</p></header></div>
<div id="content">
<div class="post-date">10 Nov 2024</div><h1 class="post-title"><a href="https://www.p-snow.org/config/diary/20241110-1236.html">閲覧中のウェブページを Org 形式で開く</a></h1>
<p>
<preview>
org-mode 中毒者のわたしとしては、どんな形式の文書でも Org で見たくなるわけです。もちろんウェブページも例外ではありません。長文が載ったページも Org でササッと折り畳みながら要点をすばやく把握できるようにしていきましょう。
</preview>
</p>

<p>
今回は、EWWでウェブサイトを見ているときにすばやくページをOrg形式に変換して表示する、という方法を検討してみたいとおもいます。<a href="https://p-snow.org/config/dotfiles.html#emacs-eww-reopen-in-org">こちら</a>が実装となります。
</p>

<p>
<details><summary>Elisp code to reopen EWW page in org</summary><p>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my/eww-reopen-in-org</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;optional</span> level)
  <span style="font-style: italic;">"Convert the current HTML page source into an org format, then open it with level LEVEL entries displayed."</span>
  (<span style="font-weight: bold;">interactive</span> <span style="font-style: italic;">"p"</span>)
  (<span style="font-weight: bold;">let</span> ((source (plist-get eww-data <span style="font-weight: bold;">:source</span>))
        (buffer (get-buffer-create <span style="font-style: italic;">"EWW page in org"</span>))
        (org-startup-folded t))
    (<span style="font-weight: bold;">with-current-buffer</span> buffer
      (insert source)
      (shell-command-on-region (point-min) (point-max)
                               <span style="font-style: italic;">"pandoc - -f html -t org"</span>
                               t t)
      (org-mode)
      (org-ctrl-c-tab level))
    (switch-to-buffer buffer)))

(<span style="font-weight: bold;">with-eval-after-load</span> 'eww
  (<span style="font-weight: bold;">bind-keys</span> <span style="font-weight: bold;">:map</span> eww-mode-map
             (<span style="font-style: italic;">"O"</span> . my/eww-reopen-in-org)))
</pre>
</div>
<p>
</p></details>
</p>

<p>
コードとしては至ってシンプルですね。ポイントとしてはファイルに書き出すことなくEmacsバッファ内で変換・表示を完結しているところでしょうか。変換エンジンとしてはおなじみpandocを使っております。キーバインドは Org で Open するから "O" にしました。
</p>

<p>
Happy Tinkering!
</p>
<div class="taglist"><a href="https://www.p-snow.org/config/diary/tags.html">Tags</a>: <a href="https://www.p-snow.org/config/diary/tag-emacs.html">emacs</a> <a href="https://www.p-snow.org/config/diary/tag-eww.html">eww</a> <a href="https://www.p-snow.org/config/diary/tag-org.html">org</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
